{"https://www.chi-awe.org/dancing": [], "https://www.chi-awe.org/initiatives": ["\nDestination for AAPI Women of Chicagoland\n", "\nMiss Asian Chicago Community and Heritage Pageant (Formerly Miss Chinese Chicago)\n", "\nAsian Fashion Show Chicago\n", "\nAAPI Women Empowerment Series\n", "\nAAPI Community Series\n", "\nSubscribe to our Newsletter\n", "\nChicago Asian Women Empowerment is a not-for-profit organization with 501c3 status. All donations are tax-deductible to the fullest extent of the law.\n"], "https://www.chi-awe.org/donate": [], "https://www.chi-awe.org/our-vision": [], "https://www.chi-awe.org/our-team": ["\nWe’re actively recruiting for 2023 - apply to be a volunteer or board member! \n", "\nWe are 100% volunteer-run organization \n", "\nLeadership\n", "\nBoard MembersTalia ChoiChairJoanne LeeSecretaryAshish ShahTreasurer \n", "\nFounder and Executive DirectorVictoria M. NgSilent Auction ManagerTalia Choi\n", "\n2022 Miss Chinese Chicago CourtXiao Lin MeiQueen and Crowd FavoriteNatalie ChinFirst PrincessVictoria LiSecond Princess and TalentJean ElliottCongeniality\n", "\nVolunteers\n", "\nPhotographers/VideographersMary Xiang Photography\n", "\n\n", "\n\n", "\nSubscribe to our Newsletter\n", "\nChicago Asian Women Empowerment is a not-for-profit organization with 501c3 status. All donations are tax-deductible to the fullest extent of the law.\n"], "https://www.chi-awe.org/join-our-team": ["\nJoin the Chicago Asian Women Empowerment team!We’re actively looking for board members, mentors, and volunteers! If you’re interested in learning more about any of these roles, please fill out this inquiry form\n", "\nBoard MemberWe need to grow our organization financially. Currently, the board’s main role is to expand our sponsor and donor base. We hope to onboard individuals who are committed to our mission of fostering the next generation of Asian women and who believe in the Miss Chinese Chicago pageant as a vehicle of empowerment. We need individuals who will commit to the general qualifications below.General Qualifications$500 Give/Get - fundraise and/or donate $500 (for the first year. Consecutive years the give/get minimum is $1000)Attend 1 required meeting 4 times per year (dates TBD), with ad hoc meetings in between.\n", "\nVolunteerThere are various volunteer opportunities! Below are some of the roles we need to fillVolunteer RolesAd-hoc event volunteersMiss Asian Chicago pageant day-of setup and breakdown volunteersMiss Asian Chicago pageant DJMiss Asian Chicago pageant Light ManagerMiss Asian Chicago pageant backstage helper (female only)Miss Asian Chicago pageant registration manager\n", "\nSubscribe to our Newsletter\n", "\nChicago Asian Women Empowerment is a not-for-profit organization with 501c3 status. All donations are tax-deductible to the fullest extent of the law.\n"], "https://www.chi-awe.org/contact": ["\nContact\n", "\nTo provide any feedback, please click the button below.\n", "\nSubscribe to our Newsletter\n", "\nChicago Asian Women Empowerment is a not-for-profit organization with 501c3 status. All donations are tax-deductible to the fullest extent of the law.\n"], "https://www.chi-awe.org/community-impact": [], "https://www.chi-awe.org/female-voices": [], "https://www.chi-awe.org/about-mentor": [], "https://www.chi-awe.org/impact": [], "https://www.chi-awe.org/sewing": ["\nEmpowerment Series: Sewing, Your WayWed, March 8, 5:30-7:30PMLocation: Chinatown LibraryThe second AAPI Women Empowerment Series workshop, it will teach you how to sew! This session was led by 2022 Miss Chinese Chicago Congeniality, Jean Elliott, who made her community platform about using sewing and soccer to empower the youth and fundraise for non-profit organizations.The next workshop will be about body positivity on April 26. Learn more here.\n", "\nEvent DetailsWHATLearn how to sew and hear Jean’s story about how sewing and soccer helped her get through her most difficult times and how she’s now using both to empower the AAPI youth! Make sure to bring a piece of clothing you want to transform or alter! where / WhenWednesday, March 8, 5:30-7:30PMLocation Chinatown LibraryWhoFOR: EveryoneBY: Chicago Asian Women Empowerment and Tanjerine Studios.CONTACTS:Session Leader - Jean Elliott, jean.elliott@misschinesechicago.infoEmpowerment Series Manager - Victoria NgAV Lead - Ashish Shah\n", "\nSubscribe to our Newsletter\n", "\nChicago Asian Women Empowerment is a not-for-profit organization with 501c3 status. All donations are tax-deductible to the fullest extent of the law.\n"]}