{"www.missasianchicago.info/cart": ["\nOperated by 501c3 non-profit Chicago Asian Women Empowerment \n", "\nPolicies\n", "\nAbout\n", "\nContact\n"], "www.missasianchicago.info/": ["\nApplication is closed! We hope to see your application come in next year. \n", "\nOperated by 501c3 non-profit Chicago Asian Women Empowerment \n", "\nPolicies\n", "\nAbout\n", "\nContact\n"], "www.missasianchicago.info/2023-contestants": ["\n2023 Miss Asian Chicago Contestants\n", "\nContestants were randomly assigned a number. Their applications were reviewed and they were accepted on a rolling basis. Official photos will be uploaded later. Application is closed - we hope to see your application come in next year!\n", "\nOperated by 501c3 non-profit Chicago Asian Women Empowerment \n", "\nPolicies\n", "\nAbout\n", "\nContact\n"], "www.missasianchicago.info/applicant-info": ["\nOperated by 501c3 non-profit Chicago Asian Women Empowerment \n", "\nPolicies\n", "\nAbout\n", "\nContact\n"], "www.missasianchicago.info/2023-dates": [], "www.missasianchicago.info/2023-training-program": ["\nOperated by 501c3 non-profit Chicago Asian Women Empowerment \n", "\nPolicies\n", "\nAbout\n", "\nContact\n"], "www.missasianchicago.info/2023-segments": ["\nOperated by 501c3 non-profit Chicago Asian Women Empowerment \n", "\nPolicies\n", "\nAbout\n", "\nContact\n"], "www.missasianchicago.info/2023-titles-and-awards": [], "www.missasianchicago.info/applicant-faqs": ["\nApplicant FAQs\n", "\nOperated by 501c3 non-profit Chicago Asian Women Empowerment \n", "\nPolicies\n", "\nAbout\n", "\nContact\n"], "www.missasianchicago.info/policies": ["\nMiss Asian Chicago PoliciesLast Updated 12/06/2022We do not tolerate any form of disrespect, harassment, or assault.Should anyone be disrespectful or harass us, we reserve the right to use any means to remove this individual from the event or remove ourselves from any interaction with this individual.We reserve the right to refuse communication, photos, or any interaction with any individuals as we so deem necessary for our safety and well-being.We will not be required to provide our personal contact information. Any communication can be directed to missasianchicago@gmail.com.We will require any event that we attend on behalf of Miss Asian Chicago to agree to our code of conduct for anyone who interacts with our former or current contestants at their event.\n", "\nOperated by 501c3 non-profit Chicago Asian Women Empowerment \n", "\nPolicies\n", "\nAbout\n", "\nContact\n"], "www.missasianchicago.info/about": [], "www.missasianchicago.info/contact": [], "www.misschinesechicago.info/2022-court": ["\n \n", "\nMy name is Xiao “Lin” Mei and I am your Miss Chinese Chicago 2022 Queen and Miss Crowd Favorite! I am so lucky to have so many supportive people who have faith in me even while I struggle to believe in myself. The Miss Crowd Favorite award is symbolic to me as it represents the community coming forward to show love for racial solidarity in Chinatown and love for me.Miss Chinese Chicago pageant has truly been an incredible experience, and I am so grateful to have had the opportunity to be a part of such a vibrant event and be part of a healing sisterhood. I can’t even put into words how it felt to be able to share the stage with 8 other many amazing ladies I can proudly call my pageant sisters. There were many instances of support these ladies provided throughout the pageant. I went on a double date, had nights out dancing, cried over the phone, and sought and received affirmation and advice. Most importantly, my pageant sisters and pageant producer, Victoria Ng, empowered me to follow my guts and trust my intuition. I gained the confidence to stand up for what I believe in and challenge the status quo despite having fear of falling off the stage and being ostracized. Fortunately, I did not fall off! As your 2022 Queen I am ready to execute my platform of racial healing and solidarity to create a positive impact and unite our greater Chinatown communitiesI will treasure these two titles with all my soul. I look forward to all the future partnerships and hope to see you at one of our community events.Xiao Lin Mei\n", "\nWhen I entered Miss Chinese Chicago, my goals were to:Make friends with fantastic Chinese women and hopefully a few role modelsLearn more about myself and what I valuePolish my public speaking skills, posing, and poiseLearn more about the Chinese communityI did not think I would win any titles. I am so humbled to be your First Princess. And even more humbled to be surrounded by the truly incredible women that make up the 2022 Court. I cannot wait to keep learning from them, as well as my other pageant sisters. They are truly, each and every one, my role models and mentors.This experience helped me hone in on my vocation: animal welfare. I will continue this mission as I manage patient care as a veterinary assistant, volunteer with animal welfare organizations, and reduce my carbon footprint. The summer of 2022 is when I submitted my veterinary school applications, so I will find out if I can become a veterinarian and make an even bigger difference this spring!For the last two goals, I am continually working on my public speaking and poise, especially when it comes to discussing my heritage. As a biracial kid growing up in mostly white spaces with Chinese grandparents that don’t like to talk about the pain of the past, Miss Chinese Chicago truly introduced me to the Chicago AAPI community. I look forward to growing as a community member to better serve you in the next year.With unending gratitude,Natalie Chin\n", "\nI'm so proud to represent curvier Asian American women as your Miss Chinese Chicago 2022 Second Princess! I entered to be the role model that my younger self wished for and show that all shapes and sizes are beautiful.I look forward to launching my podcast \"Victoriously Vulnerable\" to create a supportive space for us to be vulnerable. By sharing our stories, others will know they're not alone. The first phase will focus on body image as part of my community platform. Stay tuned! In addition to being 2022 Second Princess, I am also your 2022 Miss Talent. I look forward to sharing my flute performance and learning more Chinese pieces!Let's be victoriously vulnerable!2022 Miss Chinese Chicago Second Princess & Miss TalentVictoria Li 李光卉\n", "\nHello all! Jean Elliott here and I am SO excited to be your Miss Chinese Chicago’s Miss Con(Jean)iality of 2022.  As a transracial Chinese adoptee, I didn’t have the opportunity to grow up with a consistent Chinese community. When I moved to Chicago I proactively immersed myself in a community that I found within Chinatown and Miss Chinese Chicago. The friendship, joy, and support that I found from contestants, Lin, Kim, Ava, Mary, Victoria, Natalie, Mia, and Isabel is beyond words! Even though my parents could not personally offer me a community that looked like me, they cleared the path for me to find strength in other paths like soccer and sewing. These two activities have always been strong pillars in my personal foundation. I plan on using both activities to continue to uplift myself and the community that I now have the privilege of being a part of. I hope to bring that same love and support I received from the other contestants and the strength I have found through soccer and sewing to the greater Chinese community as your 2022 Miss Congeniality.Jean Elliott\n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/donate-2": [], "www.misschinesechicago.info/2022pageantschedule": ["\nProgram\n", "\n1 PM Opening dance + introductions1:23 PM Talent (Talent is optional this year, and the score only counts toward the Miss Talent title. Contestants go in number order.)1:39 PM 15 min intermission1:54 PM QiPao + Q&A2:16 PM Introduce Judges + Other Announcements2:23 PM Fitness2:30 PM 15 min intermission2:45 PM Silent Auction Closes + 2019 Queen Final Walk2:49 PM Evening + Community Concern 3:13 PM Crowning\n", "\nPeople\n", "\nJudges biosContestant biosEmcee\n", "\nSPONSORS\n", "\nA special shout out to all our sponsors! \n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/2022-scoring": ["\nScoring SummaryBelow are the segments of scoring. The points assigned to them are per judge, and there are a total of 5 judges this year. The total points per judge is 270. Talent is a separate score and only counts toward the Miss Talent title.Interview (30 points)- Contestants participated in an in-person interview with the judges prior to the pageant. They each presented a 5 min ted-talk like presentation about themselves, then they had 5 minutes to answer questions from the judges on the spot. The interviews will be uploaded to our pageant YouTube channel. Intro (50 points) - Contestants will get 30 sec, per language, to introduce themselves. For every 5 seconds they are over time, they receive a .5% deduction for that segment.Q&A (60 points) - Contestants will answer a question on the spot. They will randomly pick a question out of the 15 potential questions. The questions are about topics they learned about through our 3 workshops in AAPI History, Feminism, and Current Events. There is no time limit for answers.Fitness (40 points) - Contestants will walk on stage in a 2-piece bikini. They are not judged on their body, however, they are judged on how confident they are in their body and how they engage the crowd.Community Platform (90 points) - Contestants will have up to 90 sec to make a speech about the year-long community service project they would execute if they become a titleholder. The top three titleholders are required to execute their project. Since our pageant is a Community and Heritage pageant, this segment counts for the most percentage of the overall score. For every 5 seconds they are over time, they receive a .5% deduction for that segment.Talent (30 points, does NOT count toward overall score, only counts toward Miss Talent title) - This segment is optional. They are judged on how well they engage the audience.\n", "\nTitlesQueen - $1000 cash prize, $300 to be donated on your behalf to a charity of your choice*, first choice opportunity to be sponsored for Miss Chinatown USA 2023 should you qualify, promotional opportunitiesFirst Princess - $800 cash prize, $200 to be donated on your behalf to a charity of your choice*, second choice opportunity to be sponsored for Miss Chinatown USA 2023 should you qualify and Queen cannot/will not go, promotional opportunitiesSecond Princess - $500 cash prize, $100 to be donated on your behalf to a charity of your choice*, third choice opportunity to be sponsored for Miss Chinatown USA 2023 should you qualify and top two choices cannot/will not go, promotional opportunitiesMiss Talent* - $200 cash prize, fourth choice opportunity to be sponsored for Miss Chinatown USA 2023 should you qualify and top 3 choices cannot/will not go, promotional opportunitiesMiss Crowd Favorite** - $200 cash prize, fifth choice opportunity to be sponsored for Miss Chinatown USA 2023 should you qualify and top 3 choices cannot/will not go, promotional opportunitiesMiss Congeniality*** - sixth choice opportunity to be sponsored for Miss Chinatown USA 2023 should you qualify and top 3 choices cannot/will not go promotional opportunities* Optional category - contestants self-select into the category** Chosen by pageant attendees, one vote per attendee, qualified for any other title*** Chosen by fellow contestants, qualified for any other titleNote that Miss Chinatown USA has different qualifications than our pageant and they might be different every year.\n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/2022-sponsors": ["\nDiamond Sponsors\n", "\nJADE SPONSORS\n", "\nIn Kind Sponsors\n", "\nBecome a SponsorThe 2022 Sponsorship Benefits can be found hereOur contestants do not pay any fees to apply or participate. We hope to have an inclusive pageant that allows young women to showcase themselves without being burdened by costs. Therefore, sponsorship is solely what makes this pageant possible. “Although the pageant is over, Victoria continues to build us up in communication, leadership, and confidence. This isn’t just a one month event, rather this is definitely going to last a lifetime.” - 2018 First Princess Jamie Moy“Thanks to the MCC pageant, I had endless opportunities to participate in debate panels about the Asian American experience, partake in cultural events, support the people and our local community— something that I never had the chance to do and look forward to continue doing. In doing so, never have I felt more connected to my roots and heritage as I had today. ” - 2018 Second Princess Honey Tey\n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/2022-judges": ["\n \n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/2022-contestants": ["\n2022 Contestants\n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/2022-emcee": ["\n2022 Emcee Harmony Zhang\n", "\nHarmony Zhang is a professional actress and real estate broker based in Chicago. She participated in the Miss Chinese Chicago 2018 pageant, and is thrilled to be back supporting young women in the Chinese community! Harmony's hometown is Tucson, Arizona, where her family continues to be involved in the Chinese community through the Tucson Chinese Cultural Center and Tucson Chinese Christian Church. At her alma mater, Duke University, Harmony studied Psychology & Theater Studies with a Certificate in Policy, Journalism, and Media Studies. Continuing her passion for storytelling and cultural identity, Harmony then went on to earn an MFA in Acting from DePaul University. Her cultural engagement in Chicago includes teaching acting class to students in an after school program at Pui Tak Christian School. Currently, she lives with her husband and two cats, and is committed to staying involved in her community in positive and uplifting ways! \n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/2022-silent-auction": ["\n2022 Silent Auction\n", "\nWe’ve done the curating for you! This year, we had an all AAPI-owned, Women-owned and/or small business lineup of items! Thank you to all our generous donors listed BELOW! \n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/2022-photos": ["\n \n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/2022-pageant": [], "www.misschinesechicago.info/2022-second-princess-victoria-li": ["\n2022 Second Princess & TalentVictoria Li李光卉\n", "\nI'm so proud to represent curvier Asian American women as your Miss Chinese Chicago 2022 Second Princess! I entered to be the role model that my younger self wished for and show that all shapes and sizes are beautiful.I look forward to launching my podcast \"Victoriously Vulnerable\" to create a supportive space for us to be vulnerable. By sharing our stories, others will know they're not alone. The first phase will focus on body image as part of my community platform. Stay tuned!In addition to being 2022 Second Princess, I am also your 2022 Miss Talent. I look forward to sharing my flute performance and learning more Chinese pieces! Let's be victoriously vulnerable!2022 Miss Chinese Chicago Second Princess & Miss TalentVictoria Li 李光卉\n", "\nVictoria @ Miss Chinese Chicago Activities\n", "\nVictoria Community Platform\n", "\nPageant Day\n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/leadership": [], "www.misschinesechicago.info/contact-us": [], "www.misschinesechicago.info/mcc-blog": ["\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/policies": ["\nCode of ConductBelow details the policies we have regarding conduct. This is applicable to interaction with any current, former and future contestants of the Miss Chinese Chicago Pageant. We reserve the right to update these policies. We do not tolerate any form of disrespect, harassment, or assaultShould anyone be disrespectful or harass us, we reserve the right to use any means to remove this individual from the event or remove ourselves from any interaction with this individualWe reserve the right to refuse communication, photos, or any interaction with any individuals as we so deem necessary for our safety and well-beingWe will not be required to provide our personal contact information. Any communication can be directed to misschinesechicago@gmail.com We will require any event that we attend on behalf of Miss Chinese Chicago to agree to our code of conduct for anyone who interacts with our former or current contestants at their event\n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "www.misschinesechicago.info/instagram": ["\nFollow Us On:\n", "\nThe Miss Chinese Chicago was founded by Victoria M. Ng and is operated by Chicago Asian Women Empowerment, a not-for-profit with 501c3 status.All donations are thus tax-deductible and can be made here.\n"], "https://chi-awe.org/our-vision": ["Chicago Asian Women Empowerment\n\nwho we are\nWe are a 501(c)3 non-profit organization with the mission to foster the next generation of female AAPI leaders in our community. We envision a community where competent, empowered, and abundance-oriented AAPI female leaders build solidarity with other BIPOC communities to collectively and strategically make opportunities accessible to everyone.\n\n\nEMPOWER\nAMPLIFY\nBUILDempower\n\nWe provide one on one mentorship and group training\n\nOur months-long pageant program provides the following workshops\n\nEstablishing and enforcing boundaries\n\nPublic speaking\nPoise\nCurrent events\nAAPI history\nFeminism (from an AAPI lens)\nGroup workouts\n\nWe foster a supportive space where they can empower each other\n\nLEARN MORE ABOUT HOW WE FOSTER SISTERHOODamplify\n\nHEAR OUR FEMALE VOICES\nWe are AAPI Women's biggest cheerleaders\nThey drive the conversations- The AAPI Women Empowerment Series workshops are completely driven by the women of our org - they choose the topics and we work with them to develop their workshop.\n\nWe highlight them on socials - We place them front and center on all our platforms.\nWe send them to other pageants - To further amplify their voices, we support them in larger-scale pageants.\nWe connect them with opportunities to expand their network and career.Build\n\nWe're active and reliable Community Members\nWe volunteer at fellow non-profit's events and host events throughout the year. In 2022 alone we volunteered for/hosted 60+ events. So far in 2023, we've already had 25 activities. We've volunteered with 23+ non-profits.\n\nWe incubate long-term Community Service Projects\nWe work with each pageant contestant to identify their passions and skillsets and then develop an impactful year-long community service project. We also work with them to execute it.\n\nCOMMUNITY INITIATIVES\n\nCOMMUNITY\nPARTNERSHIPS"], "https://chi-awe.org/community-impact": ["Chicago Asian Women Empowerment\n\nChicago Asian Women Empowerment\n\nCommunity Initiatives\n\nWe're always looking to pair our members with non-profits initiatives! If you are interested in working with our volunteers on a project, please reach out!\n\nCOMMUNITY PARTNERSHIPS-\n10+ impactful and Community Projects\n\nIncubated by and Executed with us\n\n\n\nEach Miss Asian Chicago (formerly Miss Chinese Chicago) contestant drafts a year-long community service project plan. We work with them, one on one, to connect them with non-profit orgs in need of help or help them build a completely new idea and build the project plan. The goal is for the project to be meaningful to them and impactful to the community. Their project must meet the following evaluation criteria:\nPassion - They must be passionate about the project\n\nDue Diligence - They must have done their homework with the stakeholders, tools, impact, and agreements.\nExecution - They must define relevant success criteria, ensure they personally have or have built/joined a team that has the skillset/experience to execute it, define a schedule with milestones, and secure any required budget.\n\n\nThe year following the pageant, we work with titleholders and whomever else is interested to execute their project. Many of them continue volunteering in the community beyond their defined year of service.\n\nlearn more about projects in progress\n\nCommunity Healing\n\nXiao Lin Mei\n\n2022 Miss Chinese Chicago Queen\n\nVictoriously Vulnerable\n\nvictoria li\n\n2022 Miss Chinese Chicago Second Princess & Talent\n\nsoccer & sewing\n\njean elliott\n\n2022 Miss Chinese Chicago Congeniality\n\nSpeech Impediments & Art healing\n\nmia hitterman\n\n2022 Contestant & Miss Chinatown USA 2023 Community Serviceproject highlight\n\nJean Elliott - Sewing and Soccer\n\nEmpower the youth by teaching the youth how to play soccer and empower women by teaching them how to sew.\n\nRaised $1500+ across 3 non-profits.\n\nVolunteered 200+ hours since joining Miss Chinese Chicago.\nDrafted and implemented a youth soccer program with the Chicago Dragons.\nLed a sewing workshop with the youth at CMAA.\nLed a AAPI Women Empowerment Series workshop on sewing.\n\n\n\n\n\"Since Miss Chinese Chicago’s inaugural pageant in 2018, we have seen many young women empowered to uplift the community through their individual platforms. We have had the pleasure and honor to work with the women of MCC who are passionate about youth development and have volunteered their time and effort to support our youth organization through direct service and fundraising. We are grateful to witness MCC’s commitment to developing a culture of service, positivity, and inclusivity.\"\n\n\n\n- Sandy Ruan, Director of Strategic Initiatives, Project:VISIONlearn more about past Projects\n\nnon-verbal communication\n\nava gong\n\n2022 Miss Chinese Chicago Contestant\n\nAnimal welfare\n\nNatalie chin\n\n2022 Miss Chinese Chicago First Princess\n\ngirls basketball & women power\n\npamela yuan\n\n2019 Queen\n\naccessible medicine\n\nmegan wu\n\n2019 Miss Chinese Chicago First Princess\n\nDEI in Advertising\n\njade lun\n\n2019 Second Princess & Miss Chinatown USA 2020 Third Princess\n\nElderly welfare\n\nBrittany Lau\n\n2018 Miss Chinese Chicago Queen & Miss Chinatown USA 2019 Community Service & Congeniality\n\nYouth education\n\njamie moy\n\n2018 Miss Chinese Chicago First Princess & Miss Chinatown USA 2022 Second Princess"], "https://chi-awe.org/community-engagement": ["Chicago Asian Women Empowerment\n\nCommunity partnerships\n\nWe're always looking to partner with other non-profits. Have a project or event you need support for? Please reach out!\n\nCOMMUNITY INITIATIVESQuick stats\n\n-\n$4000+\n\nRaised for other Chicago non-profits\n-\n600+ group HRS\n\nVolunteered by our members for other non-profits\n-\n23+ orgs\n\nSupported through our volunteer work-\n23+ Activities\n\nHosted/volunteered for in 2023 so far...\n\nJan 8 - Attended the NAAAP Book Club\nJan 11 - Attended the Chinatown LNY parade press conference\nJan 21 - Volunteered to perform in the CAMOC LNY Celebration (showcasing designs by our Miss Congeniality Jean Elliott)\nJan 28 [Event 1] - Volunteered at check-in at the CMAA LNY pre-parade luncheon\nJan 28 [Event 2] - Participated in the Uptown LNY Parade with Uptown United’s float\nJan 28 [Event 3] - Participated in the Navy Pier LNY Celebration\nJan 29 - Participated in the Chinatown LNY parade with CAMOC’s float\nFeb 3 - Flew to San Francisco to support Mia Hitterman, our representative in Miss Chinatown USA\nFeb 23 - Volunteered to present a mini fashion show in the AREAA Installation Gala (showcasing designs by our Miss Congeniality Jean Elliott)\nFeb 26 - Volunteered to perform the Northbrook Cultural Fair\nMar 1 - Participated in the PBS POV Engage “Wuhan Wuhan” Documentary roundtable discussion\nMar 8 - Hosted a Women Empowerment Series workshop on sewing\nMar 25 - Volunteered at the Gawad Kalinga Chicago ball\nApr 5 - Hosted a Women’s Basketball Workout Competition. Swish House X Chi-AWE MCC Playoffs\nApr 13 - Volunteered at CMAA’s annual gala\nApr 16 - Attended Somewhere in Between - a conversation with Chinese Adoptees\nApr 19 - Attended NAAAP Chicago’s Healthy Communication: Addressing Microaggresions and Ways to Empower Yourself Through Health Communication virtual workshop.\nApr 21 - Attended KANWIN’s virtual annual gala.\nApr 26 - Hosted a Women Empowerment Series workshop on Body Positivity.\nMay 2 - Attended Diversity in AAPI Data Webinar\nMay 6 - Volunteered at the Apna Ghar gala\nMay 7 - Attended the APIDA Arts Festival Improv Workshop\nMay 21 - Had a booth at the 9-man volleyball tournament hosted by Chicago United.-\n60 Activities\n\nHosted/volunteered for in 2022\n\nJan 30 (Event 1) - Attended the Asian Justice Rally\nJan 30 (Event 2) -Attended the Light Up Chinatown events\n\nFeb 2 - Volunteered to perform at the CAMOC LNY Celebration\n\nFeb 5 (Event 1) Volunteered at the Uptown LNY CMAA Pre-parade luncheon\n\nFeb 5 (Event 2) Volunteered at the Uptown Parade\n\nFeb 5 (Event 3) We volunteered at the Chinese Fine Arts Society’s Navy Pier LNY celebration\n\nFeb 13 - Participated in the Chinatown LNY Parade\n\nFeb 26 - Participated in the Miss Illinois Latina Red Carpet event\n\nFeb 27 - Volunteered for the Miss Illinois Latina Pageant\n\nFeb 28 - Attended the Asian American Journalist Association Grief and Healing for Asian American Women\n\nMar 6 - We had a group workout session\n\nMar 12 - We volunteered at the Asian American Coalition of Chicago LNY Celebration\n\nMar 16 - We organized the Justice for Asian Women Event in remembrance of the victims of the Atlanta Spa Shootings\n\nMar 19 - We wrote spring greetings cards for the elderly\n\nMar 26 - We volunteered with KACC at the Lincoln Park Food Pantry\n\nApril 6 - We volunteered at the CMAA 40th Anniversary Gala\n\nApril 9 - We volunteered with CMAA and Celebrate Argyle to clean up Uptown\n\nApril 22 - We volunteered for Celebrate Argyle for their 1 year anniversary\n\nMay 1 - We participated in the Maria Bonita Modeling Gala\n\nMay 14 - We attended the AACC AAPI Heritage Month Celebration\n\nMay 19 (Event 1) - We volunteered for the CBCAC gala\n\nMay 19 (Event 2) - We volunteered for the AREAA AAPI heritage month celebration\n\nMay 21 - We volunteered to pick up trash in Ping Tom Park\n\nMay 22 - We attended the 9-man volleyball showcase by Chicago United\n\nJun 2 - We had a group workout session at Row House\n\nJun 4 - We volunteered to record and emcee at the Chicago Dragons 50th Anniversary gala\n\nJun 18 (Event 1) - We volunteered with Just Roots to plant and harvest veggies for the St. James Food Pantry\nJun 18 (Event 2) - We volunteered to help setup and sell raffle tickets at the CAMOC Annual Fundraiser Gala\nJun 23 - We hosted the Vincent Chin 40th Anniversary event\nJun 25 - We fundraised for and paddled with the Project:VISION and CBCAC dragon boat team for the Chinatown dragon boat race\nJul 13 - We attended CBCAC’s first community meeting\nJul 18 - We ran the Virtual “We Run Chinatown” 5k\nJul 21 - We were the beneficiaries of the Dear Asian Americans Asian Night Market fundraiser\nJul 30 - We attended Day 1 of the Chinatown Summer Fair\nJul 31 - We volunteered to perform and emcee at day 2 of the Chinatown Summer Fair\nAug 3 - We volunteered to pack and hand out backpacks for CBCAC’s Back to School Event\nAug 6 - We ran in the Uptown 5k\nSept 8 - Attended the Miss Seniorita Cicero Pageant\nSept 10 (Event 1) - Attended the Mid Autumn Festival event in Chinatown Square\nSept 10 (Event 2) - Volunteered to perform in the CAMOC and CBCAC Mid Autumn Festival event at 31st Beach\nSept 15 - Attended the CASL Associate Board happy hour\nSept 16 - Attended the Mexican Independence Day Celebrations\nSept 17 - Attended the CAMOC and OCA Chicago hosted “Rising Against Asian Hate” Screening\nSept 20 - Created videos to encourage people to register to vote, submitted to CBCAC for re-sharing\nSept 22 - Attended the info session for the proposed Near South Side High School\nSept 24 - Attended the 312 Asian Night Market\nSept 29 - Attended the No 18 Bar virtual community discussion\nOct 7 - Attended the CBCAC hosted “Chinatown Rising” Screening\nOct 8 - Attended the Global Refugee Training Farm’s end of season concert\nOct 15 - Attended CBCAC’s “Shall We Dance?” Multicultural dance workshop\nOct 20 - Attended the Chinese American Bar Association’s Annual Gala\nOct 22 (Event 1) - Volunteered to cook and distributed food at the Lincoln Park Community Services Food Pantry\nOct 22 (Event 2) - Attended the Project:VISION Soiree fundraiser\nOct 26 - Hosted our first AAPI Women Empowerment Series Workshop about speech impediments and active listening\nNov 16 - Attended a virtual event by NAAAP about how food is healing\nNov 29 - Attended the Miss Asia NIU Pageant\nDec 9 - Volunteered at the Japan America Society of Chicago’s Annual Bonenkai and Holiday Party\nDec 14 - Purchased books for the kids of CMAA and wrapped them up!\nDec 17 - Hosted a women’s basketball workout competition in collaboration with Swish House\nDec 17 - Attended the Chicago Dragons Holiday PartyCommunity partnership highlight\n\nFundraisers for Project:VISION's 2019 Dragon Boat Race and 5k"], "https://chi-awe.org/female-voices": ["Chicago Asian Women Empowerment\n\nChicago Asian Women Empowerment\n\nFemale voices\n\nWe're always looking for speaking opportunities! If you are seeking an emcee, a speaker, or you have an opportunity for us to have a booth, please reach out!\n\nOUR MEMBERSJamie Moy\n2018 Miss Chinese Chicago First Princess\n2022 Miss Chinatown USA Second Princess\n\n\"Miss Chinese Chicago 2018 was the fourth pageant I competed in, and it was also the pageant that I witnessed myself grow the most. Because of our founder and producer Victoria Ng, I was able to get out of my comfort zone and be unapologetically myself. Before, I would always try to mold myself to be the \"perfect Chinese woman\" that society wanted me to be, but after training hours on end with Victoria, she made me realize that I felt the most beautiful and confident when I was myself.\"\"What started as a challenge to push myself outside of my comfort zone became an avenue for me to gain both a sisterhood of strong and resilient women and a platform to empower Chinese individuals to better understand and manage their health. As a physician-in-training, this opportunity to engage with the Chinese community in a way that allows them to lead healthier lives is invaluable, and I don’t take it for granted.\"\n\n\n\nMegan Wu\n\n2019 Miss Chinese Chicago First PrincessBrittany Lau\n2018 Miss Chinese Chicago Queen & Congeniality\n2019 Miss Chinatown USA Community Service & Congeniality\n\n\n\n\"I have seen myself slowly grown into a woman I’d never imagine I’d become: a person who is confident in her own skin, voices out for what she is passionate about, and most importantly, an active female Chinese American community leader who is making a difference.\"Although it seemed like a small gesture, I was reminded that even though I felt alone at work, because of my ethnicity and gender, I was not alone in the fight for women’s empowerment. With her encouragement, and kindness from my pageant director, I reported the cases of sexual harassment to my manager. With the confidence I gained from this experience, I started to consider applying for a role at a company where would my abilities as a female Asian American engineer would be celebrated, not just tolerated.\"\n\n\nPamela Yuan\n\n2019 Miss Chinese Chicago QueenAlly Moraga\n2019 Asian Fashion Show Chicago Model\n\n\"I felt immensely supported by this community as well as by the coordinators of the event. They made sure to guide us towards success and make us feel confident and beautiful as Asian women. Not everyone gets the chance to be a model for a day. I am very thankful for the opportunity to participate in the 2019 Asian Fashion Show.\"Celina Xu\n\n2019 Miss Chinese Chicago Congeniality & Crowd Favorite\n2020 Miss Chinatown USA Congeniality\"I have seen myself slowly grown into a woman I’d never imagine I’d become: a person who is confident in her own skin, voices out for what she is passionate about, and most importantly, an active female Chinese American community leader who is making a difference.\"\n\n\n\n\n\n\n\n\n\n\n\nJade Lun\n\n2019 Miss Chinese Chicago Second Princess\n2020 Miss Chinatown USA Third Princess"], "https://chi-awe.org/sisterhood": ["Chicago Asian Women Empowerment\n\nChicago Asian Women Empowerment\n\nsisterhood\n\nWe foster a supportive space where aapi women can empower each other\n\nFEMALE VOICES\"As a larger Asian American woman and married, I didn't see myself as a beauty pageant contestant. But Miss Chinese Chicago, now Miss Asian Chicago, is not a beauty pageant. It's an empowering experience that strengthens you in public speaking, poise, knowledge of Asian American issues, connection with Chicago Asian American community, and sisterhood.\"\nVictoria Li\n\n2022 Miss Chinese Chicago Second Princess & Talent\"Pageantry taught me that sisterhood is about respecting each other, thinking about one another, and celebrating our wins together. Throughout this pageant journey, I’ve experienced many kindness from my pageant sisters. During this whole experience, the support was real.\"\n\nJulie Zheng\n\n2019 Miss Chinese Chicago Contestant\nRead Julie's Medium Article\"Before Miss Chinese Chicago (now Miss Asian Chicago) I’d never considered myself “pageant material.” In my head, “pageant girls” always wore lots of makeup and had to give their looks painstaking attention - something I have very little interest in. But with Miss Asian Chicago, I can come exactly as I am. Victoria and everyone else in the process - including my amazing pageant sisters - created a supportive space for me to be my messy self while I learned more about my values and polished my presentation skills. If you’re not interested in making more friends in the Asian community, if you’re not willing to go outside your comfort zone and learn, Miss Asian Chicago is not for you. But if you’re ready to grow and learn more about yourself, submitting that application is going to be a turning point in your life. That’s what this experience has been for me.\"\nNatalie Chin\n\n2022 Miss Chinese Chicago First Princess\"I remember the day before the Miss Chinese Chicago pageant, and I was feeling insecure about being intimidating to the judges since I have such a strong work history for Chinatown. However, a pageant sister, Natalie Chin, came up and talked to me about reframing and reclaiming ownership of the word intimidating as a powerful woman. There were many instances of support these ladies provided throughout the pageant. I went on a double date, had nights out dancing, cried over the phone, sought and received affirmation and advice, and my emotional and physical safety was always prioritized. These instances were not only inspiring but absolutely healing for me. I hold these lessons and affection dear to my heart as I am now the 2022 Queen of Miss Chinese Chicago and will proceed in fulfilling my platform of racial healing in the greater Chinatown area.\"\nXiao Lin Mei\n\n2022 Miss Chinese Chicago Queen & Crowd Favorite\"MCC has taught me the importance of friendship, giving back, and supporting each other. Thank you to everyone for believing in me and supporting me here today! After MCC, I will continue my work of empowering and educating the next generation of future leaders.\"\nMia Hitterman\n2022 Miss Chinese Chicago Contestant\n2023 Miss Chinatown USA Community Service"]}